trade_exp/src/Documents/АрендаНоменклатуры/АрендаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АрендаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="966054c7-5235-482e-b7ef-15ace606ebe4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c78dceba-50e8-4a3a-a189-e0760aabee53">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c94dfe3d-8911-4256-a142-56e1f43c983d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95c7f89a-c817-4972-84cf-d247b0380708">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00337579-5832-4d28-81cc-32fbfc41ec80">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6edf55c-070b-4085-88b1-42ee5c4ac2e6">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cb6017c-244e-47bb-9962-3b1ec3a31dcf">
    <name>ДатаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59141cf6-ba27-416a-b77b-31cf9d3d543d">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fcd1bab2-b145-415d-a939-c3ca529402ef">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7782ab60-d402-404d-8054-62575936bba4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfb71ace-feb4-440a-be59-7c5e4e13b134">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a36040b2-042c-4b2f-96f1-c42e400bc7f3">
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="874bb0b2-2466-4cbf-be1c-093ad26e65c0">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a976ece0-ac77-417e-8b2d-0962b97145c9">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="277e9b24-4633-4cf3-819b-447bfbf8959d">
    <name>ВозвратОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d7fce9-a9a8-4b47-8ce8-1df200b57792">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b72c666-ceb1-478a-b71c-104ac8b9e06c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ccdb1b7f-3811-4474-8d82-b9392008cb37">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4d570980-c1b7-454e-bf59-c595c475658d">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="20c4d67c-cf72-44c7-a6cc-f9347489b7a2">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1dee34e4-71aa-48f9-a004-2116675a31ad">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6778c420-c4bd-4ba5-bde6-a062087b5271">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aac6aef2-88ab-4d3e-8331-c4b02c35eb75">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ccbc682f-b82c-42b9-acb5-dae9839d6c53">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e79414f3-52e7-4477-a11f-1e5f81f0754f">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d842a7a8-1e16-430f-9c57-f7ef29f5ecd3">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9ac114a8-1e27-442e-8a46-45dda0972b02">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60fb7b62-9cd6-47b6-a642-6696dada9849">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1d9739fe-52ea-440d-b9f4-1855645fc816">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="860ca8e7-dc30-498a-9223-564dea61ee2c">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/АрендаНоменклатуры/Forms/ПодборНоменклатуры/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Склад") Тогда
		 Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда) 
	
	Номенклатура = Элементы.Список.ТекущиеДанные.Номенклатура;
	Характеристика = Элементы.Список.ТекущиеДанные.Характеристика;
	Рез = Новый Структура("Номенклатура,Характеристика", Номенклатура,Характеристика);
	Закрыть(Рез); 
	
КонецПроцедуры
